:PROPERTIES:
:ID:       8b268da3-60ae-417a-8cf4-557d164a8ed8
:END:
#+TITLE: Emacs: Intermediate Usage of Org Babel Features
#+CATEGORY: slips
#+TAGS:

Here be dragons. They're not that bad, but you should probably be able to bench
your own weight before you try.

*** Repeated evaluation of shell blocks using =:session= when =:cache yes=

Make a tmp dir

#+name: vyosTmp
#+begin_src shell :results output verbatim :session *vyos-ssh* :dir /home/vyos
export t=$(mktemp -d) && echo $t
#+end_src

#+RESULTS: vyosTmp
: /tmp/tmp.cl1tV017J9

#+name: vyosTmpTramp
#+begin_src emacs-lisp :results output value :var tmp=vyosTmp
(format "/ssh:vyostest:%s" tmp)
;; otherwise (org-babel-find-named-result "vyosTmp")
#+end_src

#+RESULTS: vyosTmpTramp
: /ssh:vyostest:/tmp/tmp.lnT15rP4QN

Tangle this via SSH to =vyosTest=

#+name: vyosTest
#+begin_src shell :tangle vyosTmpTramp
A jinja block to tangle:
#+end_src

